%%  正常运行时，单相系统参数表
% clc;
% clear all;

%%  系统参数
% 可调参数
%n = 2;                                      %    //电容倍数
%f = 50;                                     %Hz  //输出频率（调制波频率）  注：不是角频率！！
%m = 0.95;                                   %    //调制比
% 设计点参数
P0 = 20e6;                                   %V*A //变换器额定容量
Up_out = 3.81e3;                             %V   //额定输出相电压
Ul_out = 6.6e3;                              %V   //额定输出线电压
Ul_in = 1900;                                %V   //输入侧线电压
U_dcN = 2500;                                %V   //直流额定电压
N = 2;                                       %    //级联数
f_switch = 500;                              %Hz  //IGBT开关频率
%amp_modulation = 1000 * m;                  %    //调制波幅值
%T_dis = 1/f_switch;                         %s   //电容放电周期
sigma_min = 0.05;                            %    //直流电压波动范围最小值
st = 1e-6;                                   %    //采样时间
L = 0.002;
R = 1.5;
% load_L = 2.2 / (2 * pi * f);               %H   //负载电感 Z=wL=2.2
% L_1 = 1E-05;
% L_1 = eps;
%%  直流支撑电容计算
% C = P0 * T_dis / (3 * sqrt(2) * N * sigma_min * U_dcN * Ul_in);         %F   //计算电容
% C = C*n;
% C_uf = C*(10^6);                                                        %uF  //计算电容
% C = 1/(4 * f_switch) * (P0 * 1.2)/(U_dcN * U_dcN * sigma_min);
% C = C*n;
% C = 0.076800000000000;
C = 0.0234;

% %% 结温计算
% %Ts=2e-3;
% Ts2 = 0.5e-3;
% %TC=1/500;
% IN = 2800;                                                                %正是逆变，负是整流.1575A,9MVA;1400A,8MVA;1312A,7.5MVA
% f = 50;                                                                   %基波频率
% % m=0.4;                                                                  %调制比
% PM = 1;                                                                   %0 module1,1=module2
% udc = 2500;
% Td = 15e-7;
% rt = 0.294e-3;
% vt = 1.12;
% rto = 0.8e-3;
% vto = 1.56;
% Eon = 3;
% Eoff = 32;
% fm = 500;
% %m = 0.65;
% swi = 1;
% swv = 1;
